Documents/Доверенность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Доверенность</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДокументу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Доверенность/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция КоличествоПрописью(Количество) Экспорт

	ЦелаяЧасть   = Цел(Количество);
	ДробнаяЧасть = Окр(Количество - ЦелаяЧасть, 3);

	Если ДробнаяЧасть = Окр(ДробнаяЧасть,0) Тогда
		ПараметрыПрописи = ", , , , , , , , 0";
	ИначеЕсли ДробнаяЧасть = Окр(ДробнаяЧасть, 1) Тогда
		ПараметрыПрописи = "целая, целых, целых, ж, десятая, десятых, десятых, м, 1";
	ИначеЕсли ДробнаяЧасть = Окр(ДробнаяЧасть, 2) Тогда
		ПараметрыПрописи = "целая, целых, целых, ж, сотая, сотых, сотых, м, 2";
	Иначе
		ПараметрыПрописи = "целая, целых, целых, ж, тысячная, тысячных, тысячных, м, 3";
	КонецЕсли;

	Возврат ЧислоПрописью(Количество, ,ПараметрыПрописи);

КонецФункции // КоличествоПрописью()

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//М2
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.Доверенность";
    КомандаПечати.Идентификатор = "М2";
    КомандаПечати.Представление = НСтр("ru = 'М-2'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М2") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "М2",
        НСтр("ru = 'М-2'"),
        ПечатьМ2(МассивОбъектов, ОбъектыПечати),
        ,
        "Документ.Доверенность.М2");
    КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 	
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеДокумента.Ссылка КАК Ссылка,
    |	ДанныеДокумента.Номер КАК Номер,
    |	ДанныеДокумента.Дата КАК Дата,
    |	ДанныеДокумента.Проведен КАК Проведен,
    |	ДанныеДокумента.Организация КАК Организация,
    |	ДанныеДокумента.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Организация.ПолноеНаименование = """"
    |			ТОГДА ДанныеДокумента.Организация.Наименование
    |		ИНАЧЕ ДанныеДокумента.Организация.ПолноеНаименование
    |	КОНЕЦ КАК ОрганизацияПредставление,
    |	ДанныеДокумента.БанковскийСчет КАК БанковскийСчет,
    |	ДанныеДокумента.БанковскийСчет.НомерСчета КАК БанковскийСчетНомерСчета,
    |	ДанныеДокумента.БанковскийСчет.НаименованиеБанка КАК БанковскийСчетНаименованиеБанка,
    |	ДанныеДокумента.БанковскийСчет.БИК КАК БанковскийСчетБИК,
    |	ДанныеДокумента.БанковскийСчет.КоррСчет КАК БанковскийСчетКоррСчет,
    |	ДанныеДокумента.Сотрудник КАК Сотрудник,
    |	ДанныеДокумента.СрокДействия КАК СрокДействия,
    |	ДанныеДокумента.Контрагент КАК Контрагент,
    |	ДанныеДокумента.Контрагент.Наименование КАК КонтрагентНаименование,
    |	ДанныеДокумента.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
    |	ВЫБОР
    |		КОГДА ДанныеДокумента.Контрагент.НаименованиеПолное = """"
    |			ТОГДА ДанныеДокумента.Контрагент.Наименование
    |		ИНАЧЕ ДанныеДокумента.Контрагент.НаименованиеПолное
    |	КОНЕЦ КАК ПоставщикПредставление,
    |	ДанныеДокумента.Автор КАК Автор,
    |	ДанныеДокумента.Сотрудник.Наименование КАК ФИОДоверенного,
	|	ДанныеДокумента.Сотрудник.Наименование КАК ФамилияИмяОтчествоДоверенного,
    |	ДанныеДокумента.Сотрудник.Должность КАК ДолжностьДоверенного,
    |	ДанныеДокумента.Комментарий КАК Комментарий,
    |	ДанныеДокумента.ДокументОснование КАК ДокументОснование,
    |	ДанныеДокумента.ПоДокументу КАК ПоДокументу,
    |	ДанныеДокумента.ПоДокументу КАК РеквизитыДокументаНаПолучение
    |ИЗ
    |	Документ.Доверенность КАК ДанныеДокумента
    |ГДЕ
    |	ДанныеДокумента.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДанныеДокумента.Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеДокумента.Ссылка КАК Ссылка,
    |	ДанныеДокумента.НомерСтроки КАК Номер,
    |	ДанныеДокумента.Наименование КАК Ценности,
    |	ДанныеДокумента.Наименование КАК ЦенностиПредставление,
    |	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
    |	ДанныеДокумента.Количество КАК Количество
    |ИЗ
    |	Документ.Доверенность.Товары КАК ДанныеДокумента
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДанныеДокумента.Ссылка,
    |	ДанныеДокумента.НомерСтроки
    |ИТОГИ ПО
    |	Ссылка";
    
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиТовары = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиТовары",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиТовары);
	
	Возврат СтруктураДанныхДляПечати;
    
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварамУслугам = Неопределено) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	РезультатЗапроса.Колонки.Добавить("НомерДокумента", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("ДатаДокумента", Новый ОписаниеТипов("Строка"));
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);
		
		Попытка
			ТекущаяСтрока.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
			ТекущаяСтрока.НомерДокумента = ТекущаяСтрока.Номер;
		КонецПопытки;
		ТекущаяСтрока.ДатаДокумента = Формат(ТекущаяСтрока.Дата,"ДЛФ=Д");
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПечатьМ2(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_М2";
		
	Макет = ПолучитьМакет("М2");
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	ПервыйДокумент = Истина;
	
	 Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
		//ПоставщикПредставление = Шапка.КонтрагентНаименованиеПолное;
		//Если ПустаяСтрока(ПоставщикПредставление) Тогда
		//	ПоставщикПредставление = Шапка.КонтрагентНаименование;
		//КонецЕсли;
		
		//ОрганизацияПредставление = ДанныеПечати.ОрганизацияПолноеНаименование;
		
		//НомерДокумента = "";
		//Попытка
		//	НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер);
		//Исключение
		//	НомерДокумента = Шапка.Номер;
		//КонецПопытки;
		
		СведенияОбОрганизации = ОбщийМодульСервер.СведенияОбОрганизации(ДанныеПечати.Организация, ДанныеПечати.Дата);
		РеквизитыПотребителя = ДанныеПечати.ОрганизацияПредставление + ", ИНН " + СведенияОбОрганизации.ИНН + ?(ЗначениеЗаполнено(СведенияОбОрганизации.КПП), ", КПП" + СведенияОбОрганизации.КПП, "") + ", " + СведенияОбОрганизации.ЮридическийАдрес;
		РеквизитыПлательщика = РеквизитыПотребителя;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Отрез");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		//ОбластьМакета.Параметры.НомерДокумента = НомерДокумента;
		//ОбластьМакета.Параметры.ДатаДокумента = Формат(Шапка.Дата,"ДЛФ=Д");
		ОбластьМакета.Параметры.СрокДействия = Формат(ДанныеПечати.СрокДействия,"ДЛФ=Д");
		//ОбластьМакета.Параметры.ФИОДоверенного = Шапка.Сотрудник.Наименование;
		//ОбластьМакета.Параметры.ПоставщикПредставление = ПоставщикПредставление;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		//ОбластьМакета.Параметры.ОрганизацияПредставление = ОрганизацияПредставление;
		//ОбластьМакета.Параметры.НомерДокумента = НомерДокумента;
		//ОбластьМакета.Параметры.ДатаДокумента = Формат(Шапка.Дата,"ДЛФ=Д");
		ОбластьМакета.Параметры.СрокДействия = Формат(ДанныеПечати.СрокДействия,"ДЛФ=Д");
		ОбластьМакета.Параметры.РеквизитыПотребителя = РеквизитыПотребителя;
		ОбластьМакета.Параметры.РеквизитыПлательщика = РеквизитыПлательщика;
		Если НЕ ДанныеПечати.БанковскийСчет.Пустая() Тогда
			ОбластьМакета.Параметры.РеквизитыСчета = "р/с " + ДанныеПечати.БанковскийСчетНомерСчета + ", в банке " + ДанныеПечати.БанковскийСчетНаименованиеБанка + ", БИК " + ДанныеПечати.БанковскийСчетБИК + ", к/с " + ДанныеПечати.БанковскийСчетКоррСчет;
		КонецЕсли;
		//ОбластьМакета.Параметры.ДолжностьДоверенного = Шапка.Сотрудник.Должность;
		//ОбластьМакета.Параметры.ФамилияИмяОтчествоДоверенного = Шапка.Сотрудник.Наименование;
		РеквизитПаспорта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеПечати.Сотрудник, "ПаспортСерия, ПаспортНомер, ПаспортКемВыдан, ПаспортДатаВыдачи");
		ОбластьМакета.Параметры.Заполнить(РеквизитПаспорта);
		//ОбластьМакета.Параметры.ПаспортСерия = Шапка.Сотрудник.ПаспортСерия;
		//ОбластьМакета.Параметры.ПаспортНомер = Шапка.Сотрудник.ПаспортНомер;
		//ОбластьМакета.Параметры.ПаспортВыдан = Шапка.Сотрудник.ПаспортКемВыдан;
		ОбластьМакета.Параметры.ПаспортДатаВыдачи = Формат(РеквизитПаспорта.ПаспортДатаВыдачи,"ДЛФ=Д");
		//ОбластьМакета.Параметры.ПоставщикПредставление = ПоставщикПредставление;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварам.Сбросить();
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();			
			Пока Выборка.Следующий() Цикл 
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ОбластьМакета.Параметры.КоличествоПрописью = "" + Выборка.Количество + " (" + КоличествоПрописью(Выборка.Количество) + ")";
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ОбластьМакета.Параметры.ФИОРуководителя = ОбщийМодуль.ФамилияИнициалы(ДанныеПечати.Организация.Руководитель.Наименование);
		ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = ОбщийМодуль.ФамилияИнициалы(ДанныеПечати.Организация.ГлавныйБухгалтер.Наименование);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	
	КонецЦикла;	
	
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
		
	Возврат ТабличныйДокумент;
		
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Добавляет команду создания данного документа
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.Доверенность) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.Доверенность.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.Доверенность.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти


#КонецЕсли
